app/views/posts/show.html.erb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 5  ORDER BY `users`.`id` ASC LIMIT 1
---
  <strong>User:</strong>
  <%= @post.user.present? ? @post.user.email : "n/a" %>