app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`   ORDER BY `posts`.`created_at` DESC
---
  def index
    @posts = Post.order(created_at: :desc)

INSERT INTO `posts` (`content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["content", "sign in posting test\r\n"], ["created_at", "2016-06-20 02:06:18"], ["title", "test05"], ["updated_at", "2016-06-20 02:06:18"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = ?  [["id", 5]]
---
  def destroy
    authorize_action_for @post
    @post.destroy